v2206/urban_Microclimate/streetCanyon_CFD/0/air/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 5.0;
Zref                 10.0;
zDir                 (0 1 0);
flowDir              (1 0 0);
z0                   uniform 0.03;
zGround              uniform 0.0;
value                $internalField;

// ************************************************************************* //
