v2206/urban_Microclimate/streetCanyon_CFD/0/air/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1; 

boundaryField
{
    #include "include/ABLConditions"

    inlet
    {
        type            calculated;
        value           uniform 0.1; 
    }
    outlet
    {
        type            calculated;
        value           uniform 0.1; 
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.1;
    }
    air_to_street
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1; 
    }
    air_to_windward
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1; 
    }
    air_to_leeward
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1; 
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1; 
    }
}


// ************************************************************************* //
