v2206/urban_Microclimate/streetCanyon_CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                               |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     urbanMicroclimateFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         86400;

deltaT          3600;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

functions
{
    /*sysCall
    {	
    	type systemCall;
        functionObjectLibs ( "libutilityFunctionObjects.so" );
	    region street;
        executeCalls 0();
    	endCalls 0();
        writeCalls 1("./reconstructScript");
        writeControl outputTime;
	    writeInterval 6;
    }*/
    probes
    {   
        // Where to load it from
        libs            ("libsampling.so");

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   10;  

        // Fields to be probed
        fields          (T U); 
        region air;

        probeLocations
        (
            (65 5 125)
        );
    }    
}

//urbanMicroclimateFoam controls

initialSolidTimestepFactor	0.001666667;

minDeltaT       1E-6;

maxDeltaT       30;

minFluidIteration	0;
maxFluidIteration	10000;

// ************************************************************************* //
